Revit 2024 API
RailExtensionStyle Enumeration
 The extension style of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailExtensionStyle
Visual Basic
Public Enumeration RailExtensionStyle
Visual C++
public enum class RailExtensionStyle
Members
Member name | Description
None |  The rail extends to nothing
Wall |  The rail extends to wall.
Floor |  The rail extends to floor.
Post |  The rail extends to post.
See Also
Autodesk.Revit.DB.Architecture Namespace